Revit 2027 API
Space.CalculatedCoolingLoad Property
Get the Calculated Cooling Load of the Space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double CalculatedCoolingLoad { get; }
Public ReadOnly Property CalculatedCoolingLoad As Double
	Get
public:
property double CalculatedCoolingLoad {
	double get ();
}
member CalculatedCoolingLoad : float with get
Property Value
Double
Remarks
This property is used to get the Calculated Cooling Load of the Space.
See Also
Reference
Space Class
Autodesk.Revit.DB.Mechanical Namespace